In [2]:
import seaborn as sns
import pandas as pd

# titanic 데이터셋에서 age, fare 2개 열을 선태가형 데이터프레임 만들기
titanic = sns.load_dataset('titanic')
df = titanic.loc[:, ['age', 'fare']]

df.head()

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

In [3]:
# 사용자 함수 정의
def add_10(n):
    return n + 10

def add_two_obj(a, b):
    return  a + b

print(add_10(10))
print(add_two_obj(10, 10))

20
20

In [4]:
# 시리즈 객체에 적용
sr1 = df['age'].apply(add_10)
sr1.head()

0    32.0
1    48.0
2    36.0
3    45.0
4    45.0
Name: age, dtype: float64

In [5]:
# 람다 함수 활용: 시리즈 객체에 적용
sr2 = df['age'].apply(lambda n: n + 10)
sr2.head()

0    32.0
1    48.0
2    36.0
3    45.0
4    45.0
Name: age, dtype: float64

In [6]:
# 함수의 매개변수가 2개 이상인 경우(예: 시리즈 + 숫자)
sr3 = df['age'].apply(add_two_obj, b=10)
sr3.head()

0    32.0
1    48.0
2    36.0
3    45.0
4    45.0
Name: age, dtype: float64

In [8]:
# 함수의 매개변수가 2개 이상인 경우(람다 함수 활용)
sr4 = df['age'].apply(lambda a, b: a + b, b=10)
sr4.head()

0    32.0
1    48.0
2    36.0
3    45.0
4    45.0
Name: age, dtype: float64

In [9]:
# 시리즈 객체에 함수를 적용
def over_thirty(age):
    return age > 30

sr_map = df['age'].map(over_thirty)
sr_map.head()

0    False
1     True
2    False
3     True
4     True
Name: age, dtype: bool

In [10]:
# 시리즈 객체에 함수를 적용(람다 함수 활용)
sr_map2 = df['age'].map(lambda age: True if age > 30 else False)
sr_map2.head()

0    False
1     True
2    False
3     True
4     True
Name: age, dtype: bool

In [11]:
# titanic 데이터의 성별 데이터의 고유값
print(titanic['sex'].unique())
print(titanic['sex'].head())

# 딕셔너리 정의하여 값을 변환(문자열 -> 정수)
over_forty_dict = {'male':0, 'female':1}
titanic['gender'] = titanic['sex'].map(over_forty_dict)
print(titanic['gender'].head())

['male' 'female']
0      male
1    female
2    female
3    female
4      male
Name: sex, dtype: object
0    0
1    1
2    1
3    1
4    0
Name: gender, dtype: int64